a = 10
b = 20
c = a+b
 print("sum", c)
 print ("bye")

In [1]:
a = 10
b = 20 
c = a+b 
print("sum", c) 
print ("bye")

sum 30
bye

In [2]:
r = 3
area = 22/7*r**2
perimeter = 2*22/7*r
print ("area", area)
print("perimeter", perimeter)

area 28.285714285714285
perimeter 18.857142857142858

In [3]:
print ("your age ? =", age)
if age >=18:
    print("you are not an adult")
else:
        print("you are an adult")

NameError: name 'age' is not defined

In [ ]:
a = 10
b= 20
c = 30
if a<b:
    print ("success")
    if a<c:
        print ("hello")
    else :print("ok")
else: print("done")

In [ ]:
number = 0, sum1 = 0, 0
    list=[]
while number != -999
    number= int(input("please enter a number"))
    if number != -999
       list 1.append(number)
    sum+=number
print(list)
print("average of number is " , sum/100)

In [ ]:
tup= (10, 20, 30, "india","india", "china")
len(tup)

In [ ]:
d={(input("enter emplyee id" ), input("nter name")}

In [ ]:
d={(input("enter emplyee id" ), input("nter name"))}

In [ ]:
tup[3]

In [ ]:
empid = 0
while empid != -999
   d={(input("enter employee id", empid ), input("Enter name"))}
    if empid != -999
       list 1.append(empid)

In [ ]:
d = {'name' :" " , "age" :" "}

In [ ]:
def not_string(str):
  if len(str) >= 3 and str[:3] == "not":
    return str
  return "not " + str

In [ ]:
def not_string(str):
 if len(str) >= 3 and str[:3] == "not":
    return str
 return "not " + str

In [ ]:
def front_back(str):
m = str[1:-1]
l = str[-1:-2]
f = str[0:1]
g= l + m + f

In [ ]:
def front_back(str):
  if len(str) <= 1:
    return str
  m = str[1:-1]
  l = str[-1]
  f = str[0]
  return l + m + f

In [ ]:
def string_bits(str):
  x = range(str[0:], str[:100], 1)
  for i in x:
    return i

In [ ]:
def array_front9(nums):
 end = len(nums)
 if end > 4:
    end = 4
 for i in range(end): 
   if nums[i] == 9:
     
     return True
 return False

In [ ]:
def same_first_last(nums):
   if len(nums) > 1:
    return True
    if nums[0] == 1 or nums[nums.length-1] == 1:
        return True
   return False

In [ ]:
def input_from_user()
area = r**2*math.pi
perimeter = 2*math.pi*r
return area , perimeter
r = int(input("enter a radius"))
    print ("area" , area)
     print ("perimeter", perimeter)
input_from_user()
input_from_user()

In [ ]:
def input():
cp = int(input("enter cp" is cp))
sp = int(input("enter sp" is sp))
 return cp,sp

def calculate(cp,sp):
 
 if cp>sp:
    return "loss", cp-sp
 elif cp<sp:
    return "profit", sp-cp
 else:
        return"no profit NO loss", 0

    
def take_input():

inputs = take_input()
ans = calculate(inputs[0], inputs[1])
print(ans[0], ":", ans[1])

In [ ]:
def fun(list1):
    sumall = 0
    for i in list1:
        sumall+= i
    return sumall    
list1=[1,3,6,12,23]
print("sum of all values are", fun(list1))

In [ ]:
def fun(list1):
    sumall = 0
    for i in list1[1::2]:
        sumall+= i
    return sumall    
list1=[1,3,6,2]
print("sum of all values are", fun(list1) )

In [ ]:
import sys
try:
    num= int(input("enter 16 digit no."))
    assert num>16 or num<16,"error"
    assert num.isupper() or num.islower(),"error"
    assert num.isalnum() ,"error"
    assert num.isspace(),"error"
    assert num[0] == 0, "error"
except AssertionError:
    print(sys.exc_info()[1])
else:
    print("ans", num)

In [ ]:
import numpy  
A = numpy.array([[3, 4, -7], 
              [4, -11, 20], 
              [2, -9, -8]]) 
C = numpy.array([20, 33,22])
B= numpy.linalg.inv(A)
x = B * A
print(x)

In [5]:
import pandas
df= pandas.read_csv('C:\\Users\\family\\Desktop\\students.csv')

In [6]:
df.shape

(14, 5)

In [7]:
df.dtypes

Name       object
Class       int64
Maths       int64
Science     int64
English     int64
dtype: object

In [8]:
df.columns

Index(['Name', 'Class', 'Maths', 'Science', 'English'], dtype='object')

In [9]:
df['percentage']= (df.Maths+ df.Science+ df.English)/3

In [10]:
df.percentage

0     58.333333
1     51.333333
2     68.333333
3     40.000000
4     37.000000
5     54.666667
6     54.333333
7     46.666667
8     44.666667
9     56.000000
10    47.666667
11    41.000000
12    76.000000
13    52.333333
Name: percentage, dtype: float64

In [11]:
df

        Name  Class  Maths  Science  English  percentage
0       Amit      1     61       99       15   58.333333
1      Sumit      2     52       54       48   51.333333
2      Suman      1     92       80       33   68.333333
3      Kiran      2     27       27       66   40.000000
4     Lokesh      1     49       53        9   37.000000
5       John      1     59        5      100   54.666667
6      Ankur      1     60       86       17   54.333333
7    Amitabh      1     13       42       85   46.666667
8       Anuj      2     52       62       20   44.666667
9       Hira      2     59       54       55   56.000000
10  Himendra      1      9       70       64   47.666667
11    Kartik      2     88       28        7   41.000000
12    Suresh      1     77       79       72   76.000000
13    Sunita      2     27       70       60   52.333333

In [13]:
df1 = df[(df.Class == 1)]
df2 = df[(df.Class == 2)]
print(df1)
print(df2)

        Name  Class  Maths  Science  English  percentage
0       Amit      1     61       99       15   58.333333
2      Suman      1     92       80       33   68.333333
4     Lokesh      1     49       53        9   37.000000
5       John      1     59        5      100   54.666667
6      Ankur      1     60       86       17   54.333333
7    Amitabh      1     13       42       85   46.666667
10  Himendra      1      9       70       64   47.666667
12    Suresh      1     77       79       72   76.000000
      Name  Class  Maths  Science  English  percentage
1    Sumit      2     52       54       48   51.333333
3    Kiran      2     27       27       66   40.000000
8     Anuj      2     52       62       20   44.666667
9     Hira      2     59       54       55   56.000000
11  Kartik      2     88       28        7   41.000000
13  Sunita      2     27       70       60   52.333333

In [14]:
df1[(df1.Maths == df1.Maths.max())].Name

2    Suman
Name: Name, dtype: object

In [15]:
df2[(df2.English == df2.English.max())].Name

3    Kiran
Name: Name, dtype: object

In [16]:
df1[(df1.percentage == df1.percentage.max())].Name

12    Suresh
Name: Name, dtype: object

In [17]:
df[(df.Name.str[-1] =='n')][['Name' , 'Class']]

    Name  Class
2  Suman      1
3  Kiran      2
5   John      1

In [18]:
df1[df1.English>40]

        Name  Class  Maths  Science  English  percentage
5       John      1     59        5      100   54.666667
7    Amitabh      1     13       42       85   46.666667
10  Himendra      1      9       70       64   47.666667
12    Suresh      1     77       79       72   76.000000

In [19]:
df1[(df1.Maths<40) & (df1.Science>40) & (df1.English>40)]

        Name  Class  Maths  Science  English  percentage
7    Amitabh      1     13       42       85   46.666667
10  Himendra      1      9       70       64   47.666667